// Пример Натальи 10.05 из чата
const foo = () => {
    return {
        foo: 'foo',
    }
}

const bar = () => {
    return {
        bar: 'bar'
    }
}
console.log(foo(), bar())

// ************************

let a = 1, b = 1;
let c = ++a; // 2
let d = b++; // 1

console.log(c, d)

// ************************
let a = 2;
let x = 1 + (a *= 2); // 5
console.log(x)

// ************************

"" + 1 + 0 ;// string  10
"" - 1 + 0; //  -- number -1
true + false // Number 1
6 / "3"; // number      2
"2" * "3"; // number    6
4 + 5 + "px"; // string 9px
"$" + 4 + 5; // string  $45
"4" - 2; // number      2
"4px" - 2; //    Nan 
" -9 " + 5; // string " -9 5"
" -9 " - 5; // number -14 Вычитание всегда преобразует к числу, значит строка " -9 " становится числом -9 (пробелы по краям обрезаются).
null + 1; // number   1
undefined + 1; // Nan  
" \t \n" - 2; // number -2 Пробельные символы, такие как \t и \n, по краям строки игнорируются при преобразовании в число, так что строка " \t \n", аналогично пустой строке, становится 0 после численного преобразования.

// ************************

let a = +prompt("Первое число?", 1);
let b = +prompt("Второе число?", 2);
alert(a + b);

// или Вставить + можно прямо перед prompt:
// alert(+a + +b)

// ************************
